const obj = {
      key1: 100,
      key2: 200,
      key3: 300
}
    
function someFunction(obj) {
    for (key in obj) {
        if (obj.hasOwnProperty(key)) {
            console.log(`${key} - ${obj[key]}`);
        }
    }
}
someFunction(obj);

// Задание выполнено неверно. Есть несколько замечаний:
// 1. Для того, чтобы метод hasOwnProperty работал правильно, нужно передавать в него в качестве параметра ключ свойства. Иначе не понятно, наличие какого свойства вы проверяете
// 2. По заданию нужно было вывести ключ и значение собственных свойств, в текущем варианте выводится целый объект. 
// Выше исправила на правильный вариант